# Remove Duplicate Rows with Pandas

In [1]:
import pandas as pd

## Create some data

In [7]:
dat = {'x': [10, 11, 12, 10, 11],
       'y': [20, 21, 22, 20, 21],
       'z': [30, 31, 32, 30, 31]}

df = pd.DataFrame(dat)
df

    x   y   z
0  10  20  30
1  11  21  31
2  12  22  32
3  10  20  30
4  11  21  31

## Duplicated rows

In [8]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

## Remove duplicates

In [9]:
df.drop_duplicates(inplace=True)
df

    x   y   z
0  10  20  30
1  11  21  31
2  12  22  32